<%@ page import="java.util.List" %>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@include file="main.jsp"%>
<html>
<head>
    <title>Rules</title>
</head>
<body>
<div class="container">
    <div class="shadow-lg card-body">
        <center><h3>1. Общие правила форума: </h3></center>
        <br>
        <h5>
            1.1 Правила являются обязательными для исполнения всеми присутствующими на форуме. <br>
            1.2 Администрация оставляет за собой право редактировать и удалять сообщения пользователей, если эти сообщения не отвечают Правилам. <br>
            1.3 Администрация оставляет за собой право блокировать доступ на форум лицам, нарушающим Правила <br>
            1.4 Администрация оставляет за собой право блокировать доступ на форум любым лицам, без объяснения причин<br>
            1.5 Администрация форума не может нести ответственности за размещенную пользователями или рекламодателями информацию, а также за ее использование.<br>
            1.6 Администрация оставляет за собой право изменять данные Правила.<br>
            1.7 Правила не являются ни сугубо разрешительными (т.е. всё, что в правилах не разрешено, то запрещено), ни сугубо ограничительными (т.е. всё то, что в правилах не запрещено, то разрешено). О не описанных в Правилах положениях либо интерпретации Правил применительно к конкретному случаю можно спросить у администрации.<br>
            1.8 Часть правил не распространяется на администраторский состав.<br>
            <br>
        </h5>
        <center><h3>2. О регистрации:</h3></center>
        <br>
        <h5>
            2.1 Регистрация является неотъемлемой частью присутствия на форуме. Прохождение регистрации автоматически обозначает Ваше согласие с данными Правилами. Если Вы не согласны с данными Правилами, напишите, пожалуйста, Администратору или Модератору форума. Он деактивирует Вашу учётную запись.<br>
            2.2 При регистрации требуется ввести имя пользователя, проверочный вопрос (направленная против ботов), а также свой электронный почтовый адрес (именно свой, реально действующий). Аккаунты, зарегистрированные на чужие/недействующие почтовые адреса будут деактивироваться без предупреждения.<br>
            2.3 В качестве никнейма запрещается регистрировать:<br>
            - бессмысленные наборы букв и (или) цифр (вроде 56y39ge45);<br>
            - нецензурные слова (на любом языке);<br>
            - адреса веб-сайтов;<br>
            - адреса E-mail<br>
            2.4 Помимо этого запрещается:<br>
            - двойная регистрация, то есть регистрация под двумя и более никнеймами;<br>
            - регистрация двойника уже существующего никнейма (визуально схожего до степени смешения);<br>
            - захват никнеймов, то есть регистрация с целью воспрепятствовать их использованию другими потенциальными участниками;<br>
            - передача зарегистрированного никнейма другому физическому или юридическому лицу.<br></h5>
        <br>
        <center><h3>3. Язык форума:</h3></center>
        <br>
        <h5>
            3.1 Официальный язык форума — русский.<br>
            3.2 В исключительных случаях допускается создание тем и сообщений на английском языке, с разрешения Модераторов или Администраторов.<br>
            3.3 Использование прочих языков допускается только в том случае, если это специальным образом разрешено правилами раздела/модератором/администратором<br>
            3.4 Подпись участника является его личной территорией, где допускается использование любых языков.<br>
        </h5>
        <br>
        <center><h3>4. Запреты и ограничения:</h3></center>
        <br>
        <h5>
            4.1 Всем участникам данного форума строго запрещается:<br>
            - Оскорблять участников форума в любой форме (Запрещено проявление любой грубости, угроз, личных оскорблений и нецензурных высказываний, в том числе и в скрытой форме, как в отношении юридических, так и конкретных физических лиц).<br>
            - Запрещено использование ненормативной лексики (мата), включая завуалированное спецсимволами, а также грубых выражений.<br>
            - Писать рекламные тексты и сообщения коммерческого характера.<br>
            - Заниматься коммерцией при помощи ресурса.<br>
            - Запрещено обсуждение правил, действий (или бездействия) модератора/администратора<br>
            - Запрещена публикация как прямых, так и скрытых ссылок на другие конкурирующие ресурсы сети.<br>
            - За использование "албанского" языка и прочего сленга, а также за явные орфографические, грамматические, пунктуационные и прочие ошибки будут выдаваться предупреждения<br>
            <br>
        </h5>
        <br>
        <center><h3>5. Аватара и подпись:</h3></center>
        <br>
        <h5>
            5.1 Аватара:<br>
            Максимальный размер 100 на 100 пикселей, размер файла: 40.5 КБ.<br>
            - Содержание: недопустимы насилие, угрозы (на демографической, национальной, религиозной или политической основе), сквернословия (ненормативная лексика, обзывательства, грубость и т.д.), разврат (порнография), дискриминация в любых проявлениях, пропаганда наркотиков, коммерческая реклама и рекламные тексты, имитация званий/рангов этого ресурса, намеренная схожесть с аватарами членов администрации, а также изображения провокационного толка, в т.ч. с использованием нацистской символики.<br>
            <br>
            5.2 Подпись<br>
            - Максимальная высота: не больше 2 юзербаров или 5 строк текста<br>
            - Содержание: недопустимы насилие, угрозы (на демографической, национальной, религиозной или политической основе), сквернословия (ненормативная лексика, обзывательства, грубость и т.д.), разврат (порнография), дискриминация в любых проявлениях, тексты и изображения рекламного или коммерческого характера, имитация званий/рангов этого ресурса, а также изображения провокационного толка, в т.ч. с использованием нацистской символики.<br>
            - Анимация: сильно мигающие подписи запрещены (степень мигания определяется администрацией).<br>
            - Подпись под Вашими сообщениями не может быть использована для создания ссылок на какие-либо ресурсы сети.<br>
        </h5>
    </div>
</div>
</body>
</html>
